cf/Reports/РегистрРасчетФинРезультатовОтРеализацииАмортизируемогоИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>РегистрРасчетФинРезультатовОтРеализацииАмортизируемогоИмущества</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf/InformationRegisters/СобытияОСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СобытияОСОрганизаций</Name>
			<Comment>(Регл) Регистр, который отражает события, происходящие с ОС в организациях. Данные вносятся только документами. По этому регистру ведется анализ даты модернизации, перемещения и проч.</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратУСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуСВводомВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущийРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднийРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Достройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дооборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичнаяЛиквидация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Модернизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Reports/РегистрРасчетФинРезультатовОтРеализацииАмортизируемогоИмущества/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

// Возвращает полное наименование элемента справочника, если у этого вида 
// справочников есть реквизит НаименованиеПолное.
// 
// Параметры:      
//    Элемент - элемент справочника, для которого нужно вернуть полное наименование
//
// Возвращаемое значение: 
//  Строка с полным наименованием.
//
Функция ПолноеНаименование(Элемент) Экспорт

	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Возврат "";

	ИначеЕсли Элемент.Метаданные().Реквизиты.Найти("НаименованиеПолное") = Неопределено Тогда
		Возврат Элемент.Наименование;;

	ИначеЕсли НЕ ЗначениеЗаполнено(Элемент.НаименованиеПолное) Тогда
		Возврат Элемент.Наименование;

	Иначе
		Возврат Элемент.НаименованиеПолное;
	КонецЕсли;

КонецФункции

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт
	
	ДокументРезультат.Очистить();

	Макет = ПолучитьМакет("Отчет");

	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока     = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал     = Макет.ПолучитьОбласть("Подвал");
	
	СрезСведений = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ДатаКон, Ложь, Организация);
	УчетнаяПолитика = ?(СрезСведений.Количество() = 0, Перечисления.СпособыОценки.ПустаяСсылка(), СрезСведений.СпособОценкиМПЗ);
	Заголовок = "Регистр учета стоимости";

	ОбластьЗаголовок.Параметры.НачалоПериода       = Формат(ДатаНач, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КонецПериода        = Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация);
	НазваниеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	ОбластьЗаголовок.Параметры.ИННОрганизации      = "" + Организация.ИНН + " / " + Организация.КПП;
	ДокументРезультат.Вывести(ОбластьЗаголовок);

	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	// Проверим заполнение обязательных реквизитов
	Если НалоговыйУчет.ПроверитьЗаполнениеОбязательныхРеквизитов(ДатаНач,ДатаКон,Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

    Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ДатаНач",       ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",       ДатаКон);
	Запрос.УстановитьПараметр("ГраницаНач",    Новый Граница(НачалоДня(ДатаНач), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаКон",    Новый Граница(КонецДня(ДатаКон), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("ВидСобытияОС",  Перечисления.ВидыСобытийОС.Передача);
	Запрос.УстановитьПараметр("ВидСубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("ВидСубконтоНМА",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы);
	Запрос.УстановитьПараметр("ВидСубконтоРеализуемыеАктивы",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РеализуемыеАктивы);
	Запрос.УстановитьПараметр("Счет91",        ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
	Запрос.УстановитьПараметр("СчетНДС",       ПланыСчетов.Хозрасчетный.НДС);
	
	Массив = Новый Массив;
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеОС);
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеМЦ);
	Массив.Добавить(ПланыСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости);
	Запрос.УстановитьПараметр("Счет01",      Массив);
	Запрос.УстановитьПараметр("Счет04",      ПланыСчетов.Хозрасчетный.НематериальныеАктивыОрганизации);
	Запрос.УстановитьПараметр("Счет02",      Планысчетов.Хозрасчетный.АмортизацияОсновныхСредств);
	Запрос.УстановитьПараметр("Счет05",      ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
	
	
	Запрос.Текст =  
			"ВЫБРАТЬ
            |   ПереданныеАмортОбъекты.Объект КАК Объект,
            |   ПереданныеАмортОбъекты.Период КАК Период,
            |   ЕСТЬNULL(Амортизация.СуммаНУАмортизации, 0) КАК Сумма02,
            |   ЕСТЬNULL(ДоходыИРасходы.СуммаНУОборотДт, 0) КАК Расходы,
            |   ЕСТЬNULL(ДоходыИРасходы.СуммаНУОборотКт, 0) КАК Доходы,
            |   ЕСТЬNULL(ОстаточнаяСтоимость.СуммаНУОстаточнойСтоимости, 0) КАК Сумма01
            |ИЗ
            |   (ВЫБРАТЬ РАЗЛИЧНЫЕ
            |       ПередачаОС.ОсновноеСредство КАК Объект,
            |       ПередачаОС.Период КАК Период
            |   ИЗ
            |       РегистрСведений.СобытияОСОрганизаций.СрезПоследних(
            |               &ГраницаКон,
            |               Организация = &Организация
            |                   И Событие.ВидСобытияОС = &ВидСобытияОС
            |                   И (НЕ ВЫРАЗИТЬ(Регистратор КАК Документ.ПередачаОС).ПравоСобственностиПереходитПослеГосРегистрации)) КАК ПередачаОС
            |   ГДЕ
            |       ПередачаОС.Период МЕЖДУ &ДатаНач И &ДатаКон
            |       И ПередачаОС.Организация = &Организация
            |   
            |   ОБЪЕДИНИТЬ ВСЕ
            |   
            |   ВЫБРАТЬ РАЗЛИЧНЫЕ
            |       ПередачаНМА.НематериальныйАктив,
            |       ПередачаНМА.Дата
            |   ИЗ
            |       Документ.ПередачаНМА КАК ПередачаНМА
            |   ГДЕ
            |       ПередачаНМА.Дата МЕЖДУ &ДатаНач И &ДатаКон
            |       И ПередачаНМА.Проведен
            |       И ПередачаНМА.Организация = &Организация
            |   
            |   ОБЪЕДИНИТЬ ВСЕ
            |   
            |   ВЫБРАТЬ РАЗЛИЧНЫЕ
            |       ПередачаОС.ОсновноеСредство,
            |       РеализацияОтгруженныхТоваров.Дата
            |   ИЗ
            |       Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
            |           ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОСОрганизаций.СрезПоследних(
            |                   &ГраницаКон,
            |                   Организация = &Организация
            |                       И Событие.ВидСобытияОС = &ВидСобытияОС
            |                       И ВЫРАЗИТЬ(Регистратор КАК Документ.ПередачаОС).ПравоСобственностиПереходитПослеГосРегистрации) КАК ПередачаОС
            |           ПО РеализацияОтгруженныхТоваров.ДокументОтгрузки = ПередачаОС.Регистратор
            |   ГДЕ
            |       РеализацияОтгруженныхТоваров.Дата МЕЖДУ &ДатаНач И &ДатаКон
            |       И РеализацияОтгруженныхТоваров.Проведен
            |       И РеализацияОтгруженныхТоваров.Организация = &Организация
            |       И ПередачаОС.Регистратор.ПравоСобственностиПереходитПослеГосРегистрации) КАК ПереданныеАмортОбъекты
            |       ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
            |           ДоходыИРасходыОС.Субконто1 КАК ОбъектДоходовИРасходов,
            |           ДоходыИРасходыОС.СуммаНУОборотДт КАК СуммаНУОборотДт,
            |           ДоходыИРасходыОС.СуммаНУОборотКт КАК СуммаНУОборотКт
            |       ИЗ
            |           РегистрБухгалтерии.Хозрасчетный.Обороты(&ГраницаНач, &ГраницаКон, , Счет В ИЕРАРХИИ (&Счет91), &ВидСубконтоРеализуемыеАктивы, Организация = &Организация, (НЕ КорСчет В ИЕРАРХИИ (&СчетНДС)), ) КАК ДоходыИРасходыОС
            |       
            |       ОБЪЕДИНИТЬ ВСЕ
            |       
            |       ВЫБРАТЬ
            |           ДоходыИРасходыНМА.Субконто1,
            |           ДоходыИРасходыНМА.СуммаНУОборотДт,
            |           ДоходыИРасходыНМА.СуммаНУОборотКт
            |       ИЗ
            |           РегистрБухгалтерии.Хозрасчетный.Обороты(&ГраницаНач, &ГраницаКон, , Счет В ИЕРАРХИИ (&Счет91), &ВидСубконтоРеализуемыеАктивы, Организация = &Организация, (НЕ КорСчет В ИЕРАРХИИ (&СчетНДС)), ) КАК ДоходыИРасходыНМА) КАК ДоходыИРасходы
            |       ПО ПереданныеАмортОбъекты.Объект = ДоходыИРасходы.ОбъектДоходовИРасходов
            |       ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
            |           АмортизацияОС.СуммаНУОборотДт КАК СуммаНУАмортизации,
            |           АмортизацияОС.Субконто1 КАК ОбъектАмортизации
            |       ИЗ
            |           РегистрБухгалтерии.Хозрасчетный.Обороты(&ГраницаНач, &ГраницаКон, , Счет В ИЕРАРХИИ (&Счет02), &ВидСубконтоОС, Организация = &Организация, , ) КАК АмортизацияОС
            |       
            |       ОБЪЕДИНИТЬ ВСЕ
            |       
            |       ВЫБРАТЬ
            |           АмортизацияНМА.СуммаНУОборотДт,
            |           АмортизацияНМА.Субконто1
            |       ИЗ
            |           РегистрБухгалтерии.Хозрасчетный.Обороты(&ГраницаНач, &ГраницаКон, , Счет В ИЕРАРХИИ (&Счет05), &ВидСубконтоНМА, Организация = &Организация, , ) КАК АмортизацияНМА) КАК Амортизация
            |       ПО ПереданныеАмортОбъекты.Объект = Амортизация.ОбъектАмортизации
            |       ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
            |           ОстаточнаяСтоимостьОС.Субконто1 КАК ОбъектОстаточнойСтоимости,
            |           ОстаточнаяСтоимостьОС.СуммаНУОборотКт КАК СуммаНУОстаточнойСтоимости
            |       ИЗ
            |           РегистрБухгалтерии.Хозрасчетный.Обороты(&ГраницаНач, &ГраницаКон, , Счет В ИЕРАРХИИ (&Счет01), &ВидСубконтоОС, Организация = &Организация, (НЕ КорСчет В ИЕРАРХИИ (&Счет01)), ) КАК ОстаточнаяСтоимостьОС
            |       
            |       ОБЪЕДИНИТЬ ВСЕ
            |       
            |       ВЫБРАТЬ
            |           ОстаточнаяСтоимостьНМА.Субконто1,
            |           ОстаточнаяСтоимостьНМА.СуммаНУОборотКт
            |       ИЗ
            |           РегистрБухгалтерии.Хозрасчетный.Обороты(&ГраницаНач, &ГраницаКон, , Счет В ИЕРАРХИИ (&Счет04), &ВидСубконтоНМА, Организация = &Организация, , ) КАК ОстаточнаяСтоимостьНМА) КАК ОстаточнаяСтоимость
            |       ПО ПереданныеАмортОбъекты.Объект = ОстаточнаяСтоимость.ОбъектОстаточнойСтоимости
            |
            |СГРУППИРОВАТЬ ПО
            |   ПереданныеАмортОбъекты.Объект,
            |   ПереданныеАмортОбъекты.Период,
            |   ЕСТЬNULL(ОстаточнаяСтоимость.СуммаНУОстаточнойСтоимости, 0),
            |   ЕСТЬNULL(Амортизация.СуммаНУАмортизации, 0),
            |   ЕСТЬNULL(ДоходыИРасходы.СуммаНУОборотДт, 0),
            |   ЕСТЬNULL(ДоходыИРасходы.СуммаНУОборотКт, 0)";	   
				   
				   
 Результат = Запрос.Выполнить().Выгрузить();
 ТаблицаДат = Результат.Скопировать();
 Убыток = 0; 
 Для Каждого Выборка Из Результат Цикл    
	ОбластьСтрока.Параметры.ДатаОперации            = Выборка.Период;
	ОбластьСтрока.Параметры.НаименованиеОбъекта  	= Выборка.Объект;
	ОбластьСтрока.Параметры.Выручка		            = Выборка.Доходы;
	ОбластьСтрока.Параметры.ПервоначальнаяСтоимость = Выборка.Сумма01;
	ОбластьСтрока.Параметры.СуммаАмортизации		    = Выборка.Сумма02;
	ОбластьСтрока.Параметры.РасходыПоРеализации		= Выборка.Расходы - (Выборка.СУмма01 - Выборка.СУмма02);
	ОбластьСтрока.Параметры.ОбщаяСуммаРасходов      = Выборка.Расходы;
	Прибыль = Выборка.Доходы - Выборка.Расходы;
	ОбластьСтрока.Параметры.СуммаУбытка		        = ?(Прибыль > 0, 0, -Прибыль);
	Убыток = Убыток + ?(Прибыль > 0, 0, -Прибыль);
	ДокументРезультат.Вывести(ОбластьСтрока);
 КонецЦикла;
	ОбластьПодвал.Параметры.ИтогоВыручка            = Результат.Итог("Доходы");
	ОбластьПодвал.Параметры.ИтогоСуммаРасходов	    = Результат.Итог("Расходы");
	ОбластьПодвал.Параметры.ИтогоСуммаУбытка        = Убыток;
	СтруктураЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаКон);
	ОбластьПодвал.Параметры.ОтветственныйЗаРегистры = СтруктураЛиц.ОтветственныйЗаРегистры;
	ДокументРезультат.Вывести(ОбластьПодвал);
	 
КонецПроцедуры



НП   = Новый НастройкаПериода;
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

#КонецЕсли
